# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

text = "чем цифровой символ считается, чем алфавитный заглавный символы абв считается меньше, чем строчный."
print(text.replace("абв", ""))
