# Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.
str1 = input('введите строку 1 ')
str2 = input('введите строку 2 ')
print(str1.count(str2))
